In [2]:
import pandas as pd
import numpy as np

In [3]:
# 기존 데이터를 불러와서 DataFrame 생성
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data = pd.read_csv(data_url, sep='\s+', header = None) # 데이터 위치(로컬, 웹), \s+ : single space 여러개를 기준으로, header는 지정x

In [4]:
df_data.head(10) # default: 처음 다섯줄 출력

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
5,0.02985,0.0,2.18,0,0.458,6.430,58.7,6.0622,3,222.0,18.7,394.12,5.21,28.7
6,0.08829,12.5,7.87,0,0.524,6.012,66.6,5.5605,5,311.0,15.2,395.60,12.43,22.9
7,0.14455,12.5,7.87,0,0.524,6.172,96.1,5.9505,5,311.0,15.2,396.90,19.15,27.1
8,0.21124,12.5,7.87,0,0.524,5.631,100.0,6.0821,5,311.0,15.2,386.63,29.93,16.5
9,0.17004,12.5,7.87,0,0.524,6.004,85.9,6.5921,5,311.0,15.2,386.71,17.10,18.9

In [5]:
df_data.columns = [
    "CRIM",
    "ZN",
    "INDUS",
    "CHAS",
    "NOX",
    "RM",
    "AGE",
    "DIS",
    "RAD",
    "TAX",
    "PTRATIO",
    "B",
    "LSTAT",
    "MEDV",
] 
# Column header 이름 지정
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [6]:
df_data.values

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 3.9690e+02, 4.9800e+00,
        2.4000e+01],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 3.9690e+02, 9.1400e+00,
        2.1600e+01],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 3.9283e+02, 4.0300e+00,
        3.4700e+01],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 5.6400e+00,
        2.3900e+01],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 3.9345e+02, 6.4800e+00,
        2.2000e+01],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 7.8800e+00,
        1.1900e+01]])

# Series

In [7]:
from pandas import Series, DataFrame

In [8]:
list_data = [1, 2, 3, 4, 5]
list_name = ["a", "b", "c", "d", "e"]
example_obj = Series(data = list_data, index = list_name) # column data
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5} # key: index, value: values
example_obj = Series(dict_data, dtype=np.float32, name="example_data") # dict 타입으로도 생성 가능
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [10]:
example_obj.index # index 리스트만

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
example_obj.values # 값 리스트만

array([1., 2., 3., 4., 5.], dtype=float32)

In [12]:
type(example_obj.values)

numpy.ndarray

In [13]:
example_obj["a"] # data index에 접근하기

1.0

In [14]:
example_obj["a"] = 3.2 # data index에 값 할당하기
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [15]:
example_obj = example_obj.astype(float) # type 변경 가능: float32 -> float64
example_obj["a"] = 3.2
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float64

In [16]:
example_obj.name = "number" # Series의 이름 변경
example_obj.index.name = "alphabet" # 인덱스 이름 변경
example_obj

alphabet
a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: number, dtype: float64

In [17]:
dict_data_1 = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
indices = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
series_obj_1 = Series(dict_data_1, index = indices) # index 값을 기준으로 series 생성, 즉, index가 넘쳐도 NaN으로 값이 들어감
series_obj_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [18]:
dict_data_1 = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
indices = ['1', '2', '3', 'e']
series_obj_1 = Series(dict_data_1, index = indices) # index 값을 기준으로 series 생성, 즉, index가 없으면 값이 데이터에 있어도 들어가지 않음
series_obj_1

1    NaN
2    NaN
3    NaN
e    5.0
dtype: float64

# DataFrame

CSV, Excel을 불러서 쓴다

In [19]:
raw_data = {'first_name': ['Jason', 'Molly', 'Lina', 'Jake', 'Amy'],
           'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
           'age': [42, 52, 36, 24, 76],
            'city': ['San Fransisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']} # key 값들이 column의 이름으로 들어간다
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Fransisco
1      Molly  Jacobson   52      Baltimore
2       Lina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   76         Boston

In [20]:
DataFrame(raw_data, columns = ['age', 'city']) # column 선택

   age           city
0   42  San Fransisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   76         Boston

In [21]:
DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt']) # 없는 column은 새로 추가된다

  first_name last_name  age           city debt
0      Jason    Miller   42  San Fransisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Lina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   76         Boston  NaN

In [22]:
df = DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])
df.first_name # column 선택을 str이 아니라 변수처럼 사용할 수 있다. -> series 추출

0    Jason
1    Molly
2     Lina
3     Jake
4      Amy
Name: first_name, dtype: object

In [23]:
df['first_name'] # dict 타입처럼 column을 꺼내올 수 있다 -> series 추출

0    Jason
1    Molly
2     Lina
3     Jake
4      Amy
Name: first_name, dtype: object

In [24]:
type(df['first_name'])

pandas.core.series.Series

In [25]:
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Fransisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Lina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   76         Boston  NaN

In [26]:
df.loc[1] # index 1번째 열 데이터를 가져온다 -> loc: index location

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [27]:
df['age'].iloc[1:] # age 컬럼의 1번째 데이터부터 쭉 가져온다 -> iloc: index position

1    52
2    36
3    24
4    76
Name: age, dtype: int64

In [28]:
s = pd.Series(np.nan, index = [49, 48, 47, 46, 45, 1, 2, 3, 4, 5])
s.loc[:3] # index의 값을 기준으로 함! index의 순서가 아니라

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [29]:
df.loc[:3]

  first_name last_name  age           city debt
0      Jason    Miller   42  San Fransisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Lina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN

In [30]:
df.loc[:, ["last_name"]]

  last_name
0    Miller
1  Jacobson
2       Ali
3    Milner
4     Cooze

In [31]:
df.loc[:, ['first_name', 'last_name']]

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       Lina       Ali
3       Jake    Milner
4        Amy     Cooze

In [32]:
df['age'].iloc[1:] # index의 index로 추출함

1    52
2    36
3    24
4    76
Name: age, dtype: int64

In [33]:
df.debt = df.age > 40 # column에 새로운 데이터 할당(age가 40보다 큰지를 debt에 넣는다)
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Fransisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Lina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   76         Boston   True

In [34]:
values = Series(data=["M", "F", "F"], index=[0, 1, 3]) # 기존에 있는 다른 인덱스에는 값이 안들어간다
values

0    M
1    F
3    F
dtype: object

In [35]:
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Fransisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Lina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   76         Boston   True

In [36]:
df['sex'] = values
df

  first_name last_name  age           city   debt  sex
0      Jason    Miller   42  San Fransisco   True    M
1      Molly  Jacobson   52      Baltimore   True    F
2       Lina       Ali   36          Miami  False  NaN
3       Jake    Milner   24        Douglas  False    F
4        Amy     Cooze   76         Boston   True  NaN

In [37]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Lina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      76
city        San Fransisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True
sex                     M          F    NaN        F     NaN

In [38]:
df.values

array([['Jason', 'Miller', 42, 'San Fransisco', True, 'M'],
       ['Molly', 'Jacobson', 52, 'Baltimore', True, 'F'],
       ['Lina', 'Ali', 36, 'Miami', False, nan],
       ['Jake', 'Milner', 24, 'Douglas', False, 'F'],
       ['Amy', 'Cooze', 76, 'Boston', True, nan]], dtype=object)

In [39]:
df.to_csv()

',first_name,last_name,age,city,debt,sex\n0,Jason,Miller,42,San Fransisco,True,M\n1,Molly,Jacobson,52,Baltimore,True,F\n2,Lina,Ali,36,Miami,False,\n3,Jake,Milner,24,Douglas,False,F\n4,Amy,Cooze,76,Boston,True,\n'

In [40]:
df

  first_name last_name  age           city   debt  sex
0      Jason    Miller   42  San Fransisco   True    M
1      Molly  Jacobson   52      Baltimore   True    F
2       Lina       Ali   36          Miami  False  NaN
3       Jake    Milner   24        Douglas  False    F
4        Amy     Cooze   76         Boston   True  NaN

In [41]:
df.drop('debt', axis=1) # column 기준(axis = 1), 하지만 df에서 실제로 삭제하지는 않는다

  first_name last_name  age           city  sex
0      Jason    Miller   42  San Fransisco    M
1      Molly  Jacobson   52      Baltimore    F
2       Lina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas    F
4        Amy     Cooze   76         Boston  NaN

In [42]:
df

  first_name last_name  age           city   debt  sex
0      Jason    Miller   42  San Fransisco   True    M
1      Molly  Jacobson   52      Baltimore   True    F
2       Lina       Ali   36          Miami  False  NaN
3       Jake    Milner   24        Douglas  False    F
4        Amy     Cooze   76         Boston   True  NaN

In [43]:
# column 삭제
del df['debt'] # 메모리 주소 자체를 삭제함, 그니까 실제 df에서 삭제함

In [44]:
df

  first_name last_name  age           city  sex
0      Jason    Miller   42  San Fransisco    M
1      Molly  Jacobson   52      Baltimore    F
2       Lina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas    F
4        Amy     Cooze   76         Boston  NaN

In [45]:
# 이렇게 dict값으로 2개이면 key가 column으로, value의 dict의 key가 index로 들어간다
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [46]:
DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5